{"1546477368000": "\"The end is coming for me! I'm a dead man walking I tell you.\" Disheveled and dripping with sweat the man appeared to be a beggar coming to the city in search of better luck. Obviously crazy, \"It's been following me so long and I am tired. I can't run much longer. The hospice took me in once perhaps the Brothers will help me again.\" The ragged clothes could have once been fine material, but now they were torn and covered in dirt and bodily fluids. Resting both hands on his cane the man explained himself to the guard, who probably wouldn't have even thought to question him. The stick he used for balance was partially carved with a skyline that looked somewhat like Isra. A battle scene was taking form in the wood but it was not yet complete. A sword was perhaps concealed within, but the man was obviously no danger to anyone but himself.\"They'll come for me. You'll see. I ran. To war, to the bottle, to the sea, the woods, but you can never escape from your own memories. Never! I am guilty. What I have done to my family, my friends, the ones I loved. So full of guilt! He fell and I... I just left him. I fell too right here,\" He pointed towards the wall to the west, \"The Brothers took me in. As they took me from the bottle once...\"The diatribe continued. Whatever the man had claimed he was running from it apparently wasn't all that close, if it existed at all. Perhaps the guards would usher him along or make him leave. If not he would eventual get the words off his chest and continue into the city.", "1484180981000": "\"I guess you could call me a mercenary.\" Silas assented, \"Though it has been a long time sense I have been in a battle or owned a sword.\"Strolling slowly, Silas took in the life of the market.  He loved the multitude of colors and smells the emanated from each stall. Every vendor they passed sold something of necessity.  Meat and vegetables; livestock; clothes; sacred items for every religion, it was all here. This place was the life force of the city and was the best place for Silas to get to know one of it's people.Arm in arm the pair passed an array of food carts. The smell of grilled meat wafted through the air and Silas began to grow hungry. Stopping at a stall, Silas bought a piece of skewered meat.  The rare steak dribbled blood as the vendor speared it onto a sharpened stick. \"Would you like anything?\" Silas asked Skarlet , \"My treat.\"", "1484202068000": "\"Not very healthy?\" Silas looked shocked. \"I never thought about it that way. But it is hard to beat a homemade meal.\" After paying for the food Silas was left with a handful of moons.  That along with the silver piece would suffice until he found work.  The two walk separately while eating. \"You must have been on quite the adventure to get hurt like that. Have you explored much of the land?\" Silas continued the conversation.Once they had finished eating Silas thought of something that he wanted to do.  Turning to Skarlet he asked, \"Is there a library in this city?  It has been far too long sense I have read a book.\"", "1495256489000": "<Enter from roof of building>Silas's leap sent him soaring over the dark chasm beneath. In that short time of weightlessness, Silas felt like he was truly flying. He slammed into the wall, but managed to grab onto the parapet. Silas clamored onto the wall and stumbled to the opposite edge. It seemed his luck had run out.Silas looked over his shoulder...Oliver hadn't made the jump. The sounds guards shouts filled Silas's​ ears and he knew he had to keep running. He leaped...f6bVI0wW1-10Break a:1. Leg2.  + Leg3. + Arm4. + Arm5. + Ribs6. + Neck7-9. OK10. Fly away1-10", "1495256500000": "Oh fuck", "1495348564000": "Snap, went his legs as Silas hit the air cushion. He pitched forward and continued his descent. Silas screamed and flung his arms in front of himself. He hit the rocks below and began to tumble. One arm twisted unnaturally behind his back. Silas came to a jarring halt upon a obtrusive boulder. He had passed out long ago.In a dark dream Silas relived the terrible night in Gualdin. The young rich kid who had cheated at dice. How Silas has brooded and drank to much because​ if a girl. The blood on his knife as he taught the cheater a lesson. Oliver had still backed him up in the following fight.  Silas and Oliver running. Then climbing.  Silas urinating from a building onto a city guard. The guards hot on their heals.  They climbed, jumped, and kept running. After one jump Silas has heard a scream. He looked back and Oliver was gone. He mist have fallen too far for Silas got no reply from those dark depths. Everything faded. ", "1495865042000": "\"Gaaahh!\" Cried Silas as he came too, \"Oh, fuck! What's wrong with me? It hurts!\" Silas looked down at his mangled body, groaning all the while. He had a vague recollection of what he had done. He felt incredibly embarrassed and stupid, but mostly he felt pain. He had no idea of how he was going to get back to the city. Nor did he know if all his injuries would be treatable. Certainly, he was no doctor, but that arm looked fucked.\"Oh @kiera, Please help me. What's going to happen? Where's Badger? Where is the wine?\"", "1496049486000": "Alan Pericoloso  drifted into Silas's view. A flashback of the angel floating above him as he fell. Silas had bounced off of something before hitting the ground. He reached his good arm towards the angel, \"You... you saved my life...Please, bring me to a doctor.\" Silas looked at @kiera ,  \"Where's Oliver? Where's Badger ? Where is the wine?\"", "1483924808000": "Silas carried only his hunting knife, tucked into his tunic, and two silver coins. His cloths were plain, but new and clean. The mercenary longed to spend his money on booze. But Silas no longer needed the drink to forget. When his rum had run out he had sent a couple agonizing nights in the wildernes confronting his past demons.  Now he simply chose to dwell on better times.Seeing that the guards were checking people entering the city Silas slowed apprehensively.", "1493167416000": "Silas came to his senses at a corner table in some unknown tavern. \"Damn,\" He rubbed his head, \"That fairy concoction really fucked me up. Where am I?\" Silas looked around for Badger.", "1493236755000": "At the sound of a clatter Silas peered out of the booth to find Badger taking to two of the biggest mugs of beer Silas had ever seen.\"Shyit, I must have dies and gone to heaven. Hic. Don't remember anything after the Knight's Rest. But damn! I have been so hungover and drunk at the shame time. Hic.\" Silas found that he still could not think straight.  The little gnomes words seemed to be coming from the other side of a wall.\"Can't ssay it's the strangest gal I've been with.\" Silas responded, not knowing how close to the trues he was, \"But that's because I can't remember thing! Ha! Next one's on me all right, buddy ol' pal!\"  Silas raised his mug to give cheers, sloshing more of the froamy stuff to the floor.The already drunk mercenary took two long pulls before retching the mug away from his mouth, spilling an unreasonable amount down his front.  He turned his head to the side (away from Badger) and promptly vomited far more then he had just drank. Peering into his mug Silas found that it was still more then half full!\"Whooo!\" He shouted before lifting the mug to drink once again.", "1493243152000": "\"Good at drinkin' ya mean?\" Silas was more loose lipped after drinking so much, \"I've done some damned and cowardly things.\" Silas's expression became more stern as he stared into his mug.  He drank more.\"Fuckin' bandits.  Never stooped that low.\" Silas drank again and slammed his mug down angrily. \"Bastards take what they want jus'cause they can. I tell ya, I could do that too, but you don't see me killing no farmers!\" Silas was becoming nonsensical so deep in his drinks. Still he drank more, \"Fuck-ing banditos. You stick you bastards good, little buddy?\" It seemed that Silas had forgotten the gnomes name, but he didn't need to comment on that.", "1493272971000": "\"Hey,\" Silas nudged Badger and pointed at @kiera, \"Ya don't think she has a thingy do ya? Watch me put the moves on her.\" Drunk, disheveled, and smelling of vomit, Silas got up and approached the woman's table. \"You've got the look of someone with lots of experience. I like a women that can hold her own in a tussle.\" Silas winked, \"The name's Silas. How'd you like to join my friend and I.  Err on second thought maybe we should join you. HEY FAUST!\" Silas yelled to badger even though he was only a few tables away.\"Oh wait, I'm Faust.\" Silas played what he could of the night back in his head, \"Ambignome, no Badger, Thatsh it. HEY BADGER! What are ya still doin' there. Come meet my new friend, Uh, what was yer name?\"", "1493364178000": "Silas cupped his hand over his mouth and nose to try and smell his own breath. \"Hic, Don't smell too drunk to me. Bessidess, these giant mugs got enough water in 'em. The last place we were at had real drinks!\" Silas took a long long pull from his over size mug.  Glancing once at the map, Silas shifted his attention to @kiera. \"Say Missy,  You've got a gorg~eous pair of eyes. I've never seen anything like 'em. A crossbow bolt couldn't kill me, for your eyes have already pierced my heat.\" Silas rested his head on a hand as he admired Kiera's profile.  One finger wound around the mercenaries ragged hair, \"What brings a fine thing like you into the city?\"", "1493451161000": "\"Pr'aps yer right, Hic. And I gotss the drunk munchies.  You ever had the drunk munchies before? Hey Bagger, you ever had the drunk munchies before? I'mma get us all some food.\"  Silas pushed himself away from the table and akwardly knocked his chair over.\"Daaammnnn dude you drank that whole thing?  No wonder I'm the only one that blacked out at the last bar.  Can't believer you still standin'.\" The beer he had just drank was seeping into his brain and Silas was getting drunker by the second.  Perhaps the mysterious effects of the Immediate Regret were returning. As Silas stumbled from the table he stepped right into Badger's mug where his left boot became stuck. The sloshed fellow didn't even notice and the new beer shoe actually helped stabilize his stride. ", "1493529919000": "Silas wobbled back to the table, still sporting the pseudo-pegged leg. He cradled an unopened bottle of wine, \"Hic, The barkeep shays he won't sell me no more ail. But look at this! I shined him up good and he sold me a bottle of Medanese Gold.  Haha, They ain't even changed the label yet.\"  A short time after Silas sat down a large roast chicken was delivered to the tables as well as mugs of water. Not minding his manners Silas dug in ferociously. After he ate Silas sat at the table in silence.  A worried look coming over his face.", "1493532118000": "\"It's the damnedest thing, but my foots gone all cold! And shyit, why an I so wet? Can I have some of yer beer Badger? Might warm my my foot up.\" Silas took a long drink from the mug, which was actually his. He belched and slammed it down, \"Maybe I can walk it off.  What say you two we go on andventure?!\"", "1493745219000": "\"Look at my foot to warm it up?! Hic, Damn these hiccups! Now that's the crazies thing i'v eve' heard!\" Badger seemed unresponsive so Silas finished his beer. And through the tankard over his shoulder, \"But yer right! A waalllk would doo me gooood.\" He got up, knocking over yet another stool, and stumbled backwards.  As he did so the other foot became firmly wedged into the second tankard.  Silas, of course, failed to notice anything. \"Come 'n, Bagger. We goin' on an adventure!\" Silas clomped over to the gnome, one boot squelching. His right handed still gripped the bottle of Medenese Gold by the neck. He placed the bottle on the table to keep his balance as he slung Badger over his shoulder. The extra surface area the tankards gave Silas's feet helped with his balance, but still he weaved side to side as he made for the door. Hopefully, @kiera would help him along.", "1520118109000": "This sad day, much like most days, Silas found himself at the tavern quite early. The disheveled man preferred drinking at the Midnight Sun, but recent actions made him feel like that place was no longer an option. Already drunk, Silas looked around the bar for someone to spill his woes upon. ", "1520231773000": "\"Well fuck me sideways! It's Gnomenicat, no Faust, no wait that was me...Badger!\" Silas slid the coin forwards, wherever it had come from, and ordered two more drinks before finishing the one before him. Slamming the mug down so hard the handle broke, \"Damn, but is has been too long or I've drunk to much if I forget your name already. Take this, will ya,\" After passing Badger his drink Silas took his own. In his other hand he leaned upon a cane and followed Badger with an obvious limp. At the table he leaned the ornately  carved stick on his chair within easy reach. His twisted leg did not stop him leaning his chair back on two legs however.  At the table a serious look came over his face, \"I'll have to warn you old friend...I'm a dead man walking. These three weird priest did my fortune a while back and said that it was certain. Don't know when, but I can feel it will be soon.\"Silas took a drink like everything was normal, but the let his head fall to the table and started crying, \"I lost her damnit! Had a good thing and fuckin' threw it away! Didn't know what to do damnit. Couldn't even face 'er.\"", "1487115931000": "After all that had happened in since he arrived in Isra, Silas thought that he deserved a drink, or two, or three. Why not make a night of it?  Just one night of binging couldn't hurt, could it? Silas took a seat at the bar and ordered a pint of ale before looking for someone to start up a conversation with.", "1487199088000": "\"Ambicat! It's good to see you again. Oh-\" Before Silas realized it he was caught up in Badger's story. He took deep drinks from his ale as he listened. Lowering his mug, Silas guffawed along with the little man. \"Well Ambignome, the next one's on me anyways.\" He finished his beer and wiped the foam off his face.  Silas let out a belch and ordered another round.\"Reminds me of a night out in Travere. Someone had the idea to climb a building and piss on the guards. Silly bastard actually did it. I was so drunk it might of been me!\"  Silas chuckled at the hazy recollection, \"Anyways we ran all around that city hiding from the guard.\"", "1487382221000": "\"Haha. Oh, the name's Silas. I hope I leaned something last time, though I can't even remember how that night ended.\" Silas did remember but he did not think on that now. Instead he drained his second drink in a couple long pulls.\"Well, hic, friend. How's 'bout we find us another bar with something stronger than this horse piss. I hear the Knight's Rest has a drink that will have you seeing La Fée Verte in no time.\"", "1487468325000": "Silas payed for the drinks and tucked his purse back into his shirt. The recently stuffed purse lay nestled next to his long hunting knife. Sleek and made of fine wood and strong metal, the weapon was crudely wrapped in cloth.\"I'm not carrying you just yet, but we'll get to the next tavern. It's the tavern after that I'm worried about reaching. Ha! We'll hit all the bars in town!\" Silas tousled the gnomes hat as the exited the Violet Witch. ", "1485386820000": "A third shadow arrived at the graveyard the same night.  Silas had become convinced that if the cloaked women were to have any nefarious plans for the city she would go about them in a place like this. After dinner with Skarlet he had excused himself and come to investigate his hunch. Rather then enter the graveyard, Silas hid himself in the shadows of an ally near the main gate.  He waited, listening carefully to the night.", "1485844326000": "Grating stone broke the nights silence. A crash sent shivers running up Silas's spine. He pinpoint the location and began to creep quietly through the graveyard. He cautiously hid behind each gravestone, driven by his curiosity of the unknown and morbid?", "1486511837000": "Silas spotted a a faint golden glow coming from beneath a tree. This was about where he had heard the sound.  Silas loosened his nervous grip on his spear and prepared himself to spring into action. As his eyes adjusted he could make out the silhouette of person with golden eyes. Surely this was the necromancer.", "1484780250000": "Jan 17, 2017 11:47:17 GMT -8 Skarlet said:\"We could go to the plaza, and then from there we can figure out what's next. From there it's easy to find places.\" Skarlet led the way to the Plaza once Silas was done with his research. \"I dunno, it's a mystery for me, but Isra is a big place so it may be easier to blend in. Who's Lynx?\"\"Lynx was a warrior mage of the Celadine clan. She was the one that killed all those dragons.  This is kind of a long shot, but I once encountered a powerful women named Cel who was the servant of a dark warlord.  She carried mage gear that I have only ever seen a Celadine use...\"  The piece to the puzzle were beginning to fall into place. At least Silas thought he might be making sense of it all, \"The book mentioned that the awakening energies in the draconic graveyard might be linked to happenings in the west.  It was published around the time I met Cel... Perhaps, Cel was using Lynx's battle rig and the aura reverberated in the Land Tillers Expanse.\" Silas was unsure how magic worked, but that seemed plausible.Silas continued his train of thought, \"That was just before the orbs were rediscovered and the dragons began returning. Then Goraia took over and now the war... Is it possible that this is all related?!\"  Silas was stunned by his own conjecture, though he might have lost Skarlet, \"Could the cloaked women be affiliated with Goraia? but that's a logical fallacy...Still that would be bad.\"'The bottom line is that the bones dug up from the draconic graveyard hold some power...Say, is there anything important buried in Isra?\" Silas was so caught up in this mystery that he failed to notice the grandeur of the plaza around him.", "1485060787000": "\"I'm sorry, I must be boring you.\"  Silas flushed, but then his eyes widened slightly as he took in the plaza.  \"This really is a very beautiful city.\" He pointedly looked at Skarlet, \"With very beautiful people. How would you want to spend the rest of this early twilight?\"  Sun set was near and all seamed peaceful in the tranquil city.", "1485481413000": "Before Silas could respond the wolf howled and all attention was drawn to the podium. \"A new threat, huh?\" Silas mused before turning back to @skarket. \"I would love dinner. Truth is I'm pretty short on coin. I could use this work,\" he guestured to the podium, \"Asuming it pays. Do you mind if I go find out more? We can meet at the Midnight Sun in an hour if you need to get ready.\"", "1485542600000": "When Silas got to the base of the podium he noticed the impressive Cael first.  Tentively he presented the back of his hand for the large beast to smell.\"What d'ya pay?\" Silas voiced his question as soon as the women asked.", "1485635067000": "As Kaylie spoke Silas cautiously scratched Cael behind the ear and thought of getting a canine of his own. \"Fair enough.\" Silas followed Kaylie.<Exit>", "1449087708000": "There were plenty of clothing store in the city no doubt.  Many of them would probably be far cheaper then this one.  Something had drawn Silas to St. James Boutigue.  The bedraggled mercenary, dressed in tatters and covered in dirt, found himself in the clean and tidy clothing store without realizing he had entered the store. If he had considered the possibility, Silas may have realized, or even felt, that there was a magical aura here.  Without thought to his current attire Silas started searching through the store.  There was something he needed here...No, it was almost like something here needed him.  What was it?", "1449169099000": "(Is that a picture of Jamie Lannister?)Silas took the coat gingerly in his arms. Yes, this is what he came for.  He made his way, slowly, eyes ever on the coat, to the counter.  \"I'll take this.  Whatever the cost.\"  Silas set his purse, brimming with gold and silver, onto the counter.  He had grown a bit hysterical in his desire.  Never would he normally show all his money to a store clerk.  That was bad bargaining.", "1449261054000": "Silas did not sense the change of atmosphere. He did notice the change in the woman's demeanor though.  The mercenary could tell when he was being pumped for information. \"I was once part of a quest with a women once who looked very similar to you.\" Silas spoke over the curtains. \"Black hair, tan skin, a petite build.\"  Silas could remember Jun's figure clearly. \"She said she was from the Land-Tiller's Expanse.\"  Silas left out Jun's name and clan for now, unsure of the young woman's motives.", "1449469430000": "\"I'm not sure I'll ever meet her again.  If I do I'll give her the message.\"  Silas responded to Intaja.  \"By the way.  The name is Silas.\"Silas complied with the tailor and put his arms through the extended sleeves.  The jacket fit surprisingly well.  It lay across his shoulders like it had rested there for years.  Silas picked up his coin pouch, abashed at his momentary lapse of reason, and made it disappear in a inner pocket that he somehow knew was there.\"I don't believe how comfortable it feels.\"  Silas said.  Wearing the fine coat made him feel the need to shave and bathe.", "1449479136000": "\"You have a beautiful child.\" Silas said earnestly as he fished the required money out of his new coat. His face went slack and tranquil for a moment as he watched the little girls display of curiosity.  \"What does her father do?\" Silas pulled himself out of his reflections.", "1449517459000": "Silas took the change, conscious of the grime that covered his hands.  Briefly he wondered why he had come here rather then getting cleaned up in an inn first.  \"I am not certain how long I will be staying.\"  Silas took the change.  \"A friend said he would meet me here.  Though I am not certain when...\"  It would be nice to stay and enjoy the holiday season.  The Free City seemed like a place that Silas could settle down in.  Oliver has seemed so worried.  Would the boy be okay?Silas pushed the worries out of his head. \"Does the whole city decorate for Yuletide?\"  The change was tucked into his pocket.", "1449656467000": "\"By all means.\"  Silas leaned on the counter. \"I just arrived from the...south.\"  Silas was going to say Teutonic State, but he did not want to bring up a battle in such a festive setting. \"This is my first day here in fact.  Normally, I would have cleaned up a bit, but something compelled me to enter this store.\"  Which had been a bit puzzling. \"I am glad I did.\"  Silas smiled and was struck for the first time by the seamstress's eyes.  He felt a brief sensation, as if falling into the sky, and blushed.  Eyes flickered down, hoping to hide the red tint to his cheeks.  \"It is a very nice coat.\" Silas fiddled with one of the tassels. \"Back home we celebrated the winter solstices around this time of year.\" Silas looked up, the flush having left his face. Again the depth of her eyes still drew his attention but Silas was no longer captivated.  \"We didn't have a name for it and there were no decorations.  It was a meaningful day though.\"  Silas was beginning to get lost in thought.  \"We celebrated life, and love, the previous years harvest, and the next spring to come.  It was a warming of the hearts on the darkest day of they year.  Friends and Family came together-\" The words stopped, remembrance ended.\"What's your name?\"  The change in conversation was abrupt.", "1449736066000": "Silas smiled at Odette when he popped up.  He remembered how hard it was as a child to politely interrupt a grown up conversation. It was best to burst in rather then wait and wait and forget what you were waiting for.\"Gene-vi-eve\" Silas repeated slowly, savoring the Gallic pronunciation.Surprised yet please at the invite Silas accepted, \"I would be honored.  Do I have time to get cleaned up?  This fine coat deserves better companions then the rags I am wearing.\"", "1449785655000": "\"New clothing would be nice.\"  Silas said. The washroom would do just fine.  Silas would get a shave latter. Silas would take the clothing and pay for them and then get changed and washed up for dinner.<Exit>", "1496460744000": "A hazy awareness filled Silas as he drifted in and out of a painful sleep. Eventually, he awoke feeling better then expected. His head seamed very foggy and when he moved bursts of pain shot through him.\"So you are awake?\" Came a doctor's voice, \"You took quite the fall yesterday. You broke a lot of bones, but surprisingly few are full breaks. Fractured left tibia, fractured right femur, five cracked ribs. Your left wrist is fractured...The right arm though.\"Silas's left arm had a cast on the forearm, but the right had a full cast and sling.\"The radial and ulna broke in two spots each, not to clean. It'll mend but won't ever move the same. The humerous and collar broke as well, but much cleaner. You will have to remain here for with some time...\"", "1496608694000": "\"Oh, fuck me! I don't even remember what happened.  I know I fell from somewhere...\" When the doctor left Silas looked at @kiera, \"You look very familiar...have we met? Did you bring me here?\"", "1484355874000": "\"I like all sorts of books.\" Silas responded, \"Though I haven't read one lately. What interests me most is the sheer amount of information you can learn from reading.\" Silas offered his arm again and allowed his pretty companion to lead them onward, \"Today I want to research an unusual public notice I saw earlier. Have you seen it?  About the cloaked women.\"In the center of the city the five story library towered into the air; a monolith of knowledge.  Although he wanted to ask about the manner in which Skarlet had disposed of the bandits, Silas decided to pursue a more amiable conversation, \"Did you discover new lands on your journey? It must have been exciting going where no one has gone before. Or perhaps there were people there already?\"  When they entered the library Silas leaned a little closer to Skarlet's ear and whispered, \"Lets look around. What is your favorite section?\" ", "1484456346000": "\"A necromancer...That sounds right.  The poster said she was a grave robber and used dark magic. Anyways, I want to research the Land Tillers Expanse, where she was said to be last...Truth is, I'm pretty sure I recognized the women at the gates of the city.\"Silas let go of Skarlet's arm and began to wind his way through the shelves, looking for the science science. Stopping at biology Silas picked out a book at random.\"Biology is fascinating.\" He opened the book and began to read\"'A section of a protein in Clostridium botulinum, the microbe that causes botulism, can behave like a prion when it is inserted into yeast and Escherichia coli bacteria, researchers'... Man, that's dense!\" Silas put the book back, \"Can't say I've read much bio, just a little bit about nature.\"  Silas paused in thought, then turned his attention to Skarlet . For the first time he really admired her outfit. The clothes clung tight to her body showing off the sensual curve that flowed from her chest into her ample rear. A short skirt gave way to slender legs and the long boots promised more. Silas shifted himself closer to Skarlet in order to speak quietly, \"What would you be researching in biology? Anatomy perhaps?\" The blood red and black of the outfit contrasted seductively with pale white skin, drawing uncontrolled eyes to her bosom. And how could one not be distracted with the bustier practically popping her heavy breasts out.Creamy white and so soft was the skin of the vixen's face. His eyes alighted upon hers and a roguish grin spread, \"I doubt many people come to this section of the library. Less in geography.\" Silas took his companion by the hand and led them to the next section.", "1484618300000": "Silas was amused by Skarlet's giggle.  It was good that she had a dark sense of humor. \"What happens to the person once they lose their mettle?\" Silas found the shelves dedicated to the Land Tillers Expanse, \"Strange how cartography is such an undeveloped field. Though it does make traveling the world more romantic.\"  He began shifting through the books, looking for a newer text.  Finding one he began to look for clues, \"Hmmm?  The draconic graveyard has been emanating a magical aura recently.\" He kept reading but stopped abruptly. \"Lynx!? Could her magic still be there?\" Silas cast his mind back, remembering an adventure from long ago. Not wanting to keep Skarlet waiting too long Silas made his research quick. After placing the book back on the shelf Silas turned to Skarlet, \"Where should we to go next?\"  Leaving the library Silas would take Skarlet's hand as they walked and ask, \"Why do you think this necromancer would come to Isra? \"", "1459643764000": "Silas cared little that he was lost. Wandering with no direction was his favorite way to explore a city. He had found a barber and got a shave and a haircut.  As he rubbed his smooth chin Silas felt like a new man with his fine coat. Furthermore, it was far more comfortable strolling a city without carrying around a sword, spear, and shield, though the lack of the familiar weapons was a bit disconcerting.\"The Midnight Sun\" Read the sign. A healthy noise spilled out of the establishment.  Silas had heard the name on the streets. It seemed to be a popular place. It would be a good place to wait for Oliver. Entering, Silas approached the bar and took a stool. Waiting for the bartender Silas scanned the room for any interesting characters, or cute girls.", "1459648109000": "Apr 2, 2016 16:51:48 GMT -8 The Starlight Dawn said:“Find work? Why, you’re in THE place to get a job! It doesn’t matter what field you’re looking to go into, The Midnight Sun is the biggest employer in Isra!”Usually this would have sparked Silas's interest, but he we doing fine on coinage after the Teutonic State campaign. Silas spotted a lithe waitress across the room.  The first thing he noticed, of course, were the bunny ears. They were incredibly cute. Despite the business of the parlor she wove through the tables with grace and serenity. Her puffy tail bobbed she worked and Silas wondered if it were real, amongst other things. He waved he over hoping he was not too busy.", "1459748307000": "For a brief moment Silas gazed into the young women's eyes and said nothing. Secretly and selfishly he enjoyed monopolizing her time, if only for a few seconds. The ruby eyes shined as if they held a secret that no one else knew, or so Silas romanticized.\"You must see a lot of people come through here. Have you noticed a young man with shaggy brown hair and hazel eyes?  He carries a large yew bow. Unmistakeable.\"", "1459810730000": "Too bad.  Silas had little hope anyways. \"The young man's name is Oliver.  If he comes in perhaps you could tell him I was looking for him.  The name is Silas.  I'll probably check back at some point. You see, we never agreed on a meeting spot...\" Silas was beginning to wonder if it would be possible to find Oliver in such a large city.", "1483930031000": "Skarlet The hubbub of clinking glasses and murmuring people seemed to appear out of no where as the doors of the Midnight Sun opened.  At first Silas welcomed the familiar sound, but as his eyes fell upon the bar a similar memory plagued his mind.  A sudden wave of nausea, anger, and sorrow flooded Silas and he put a hand against the wall to steady himself.  \"I didn't mean to...\" The half sob escaped unbidden from the mercenaries trembling lips. He wanted to leave, but instead shut his eyes and took a couple deep breaths, centering his mind once again. Hoping no one had noticed his momentary shock Silas took a seat facing the door. Tipping his chair back onto two legs Silas cast his thoughts back to the last time he had been here.  The strange, yet beautiful serving girl came to mind.  He remembered that she had unusually pale skin and red eyes. These traits were exotic and intriguing to Silas. Still he wondered if the tail were real.  Silas stared off into space as he mused.", "1484006649000": "Caught in thought Silas did not notice the approach of Skarlet. She stood there in the same skin tight outfit that she had been wearing before.  Given his previous thoughts Silas blushed a little and failed to notice his loss of balance. The precariously balanced chair toppled backward, crashing to the floor.Momentarily stunned, Silas said the first thing that came to mind, \"Say. Are those rabbit ears real?\" ", "1484079272000": "Silas's blush deepened as he picked himself off the ground.  At least he didn't have to ask about the tail.  \"Ah, well, you see...I knew this dog man once.  He looked just like a golden retriever but walked on two legs and spoke quite fluently. Never seen anything like it. Ever sense then I have been much more open to...uhh, well, it is quite an interesting world we live in.\"  Silas cut himself short realizing he was about to start rambling. Standing he extended his hand and smiled for the first time in a long time, \"The names Silas. I remember you from the last time I was here but I never got your name. I hope you don't think me a fool.\" ", "1484108099000": "The young women's smile would inspire courage in the heart of any man. \"Skarlet ,\" Silas tested the name, \"I don't supposed you would want to show me around the city when your shift ends? Last time I was here I didn't have much time to explore.\"  Silas thought of the two lonely silver coins hidden in each shoe.  He had forgot to change them and didn't know if he could afford the lavish tavern's food. \"No food for me now. I was going to see about a room after a bit of a rest.\"", "1484122920000": "\"Great! See you soon.\"  Silas went to the front desk to exchange one of his silver coins and pay for a room.  He didn't know the exchange rate of silver, but hoped to get a Sun in change. Being frighteningly low on coin, Silas would need to look for work in the coming days. Silas queried Cecil about some of the quests he had seen posted in the city, \"Do you know what sort of positions the Isra military is trying to fill? Also, I saw this poster warning the public to beware some cloaked women, but there was no contact info or bounty.\"_\"Hmm, no where in particular. I do find this street fascinating though. There is something romantic about it being closed on either end. Want to explore the market? If you haven't eaten yet we can find a food stand.\" As the pair left the Midnight Sun Silas would offer the crook of his arm if Skarlet was so inclined. As they walked Silas admired her change of cloths.  She seemed to quite fashionable. The man could tell that Skarlet was sweet and had a good heart. Wanting to know more about her he asked the obvious question, \"If you don't mind me asking, how did you receive those wounds?\"", "1486590622000": "Silas entered the Midnight Sun.  He wore new cloths, but still needed a shave and a haircut. The newly acquired spear was sheathed and slung over his shoulder. Spotting @scarlet, Silas crossed the room and handed her a yellow flower he had found in the plains. \"Sorry, I took so long. The quest took longer then expected. But we can talk about that latter. How about that dinner?\"", "1486769996000": "The hungry mercenary couldn't help but order The King's Ransom, rare, along with a glass of the house red. He felt bad about splurging, but would offer to pay the tip at the end of the meal. Silas avoided the peas (not that he was afraid of demons).When asked the question a sad look came over Silas's face. However, since it had been such a long time, he found it was not so painful to think of his family. \"It seems like a different life now. I was born into a noble family, believe it or not.\" Silas leaned his chair to balance on two legs as he spoke, \"Our nation, just a city state, was being pressured by a neighboring nation to give them our allegiance.  Father refused and was killed. As was my older brother. I ran. Don't know what happened to the rest of 'em.\" Silas went silent, not knowing what else to say. ", "1486834756000": "Kidnapped? That seemed worse then Silas's background. \"You are doing well for yourself after going through so much.  Why didn't you tell your father who you were? If you don't mind my asking. Don't you think they would like to know that you are ok?\" Silas continued to savor the steak, finishing it first, while the red meat was still hot.Since Skarlet had opened up to him, Silas found it easier to talk of his past, \"I suspect my mother and sisters are still alive.  Married off no doubt. Once, I wanted to form a band of mercenaries, maybe even an army, in order to retake my home. I just never seemed to get my act together.\" ", "1487108636000": "\"That makes sense. At least your brother knows.\"  Silas finished his steak and moved on to the fried potato skins.  They were crunchy and delicious. The wine was beginning to give him a slight buzz.  It had been a while since he had drunken alcohol. He wanted more but didn't want to get drunk while on his first date Skarlet.\"That is good that you found a new family. So your mother is in politics? What does she do?\"", "1487383115000": "Silas was intrigued by Skarlet's cryptic answer, but he had no reason to press for more details. Skarlet interested him far more at the moment. \"I don't think I have tried my favorite food yet. But I can tell you the worse thing I ever ate. Boiled grubs! Turns out they're much better roasted.\" Setting his fork and knife together on the empty plate, Silas probed deeper, \"Staying occupied does seem to be the ultimate goal. So, Skar, how do you keep yourself occupied when you are not working?\"", "1487526815000": "\"Yeah. Insects will keep you alive if you eat enough of them. I've been somewhat of a tramp since I left home. Can't imagine wearing fine cloths in court anymore.\"\"Whoa,\" When Silas had asked about hobbies he had not expected dream walking of all things. The mercenary had little knowledge of magic, but he had seen enough of it to realise it's usefulness.\"That is fascinating.  I've heard that anything can be accomplished with magic.  Is it true that anyone could learn to use it?\"", "1492988798000": "Feb 21, 2017 15:31:25 GMT -8 Skarlet said:\"I'm not an expert, so I couldn't really tell you if that's true. My ability only revealed itself by coincidence. I don't study magic, but there is a place for that in the city. One of the towers of the Citadel is called the Enclave, where magi study and train. I've never gotten around to checking the place out. There used to be a minister of magic named... Andraste Ruana I think, she knew the current Arch-mage, she disappeared many times and hasn't been seen since the last time. Perhaps she's gone somewhere to leave the spotlight, the new Arch-mage is much more present. I've gotten to see him up close a few times, while I was with my mother. He looks like he's made out of magic! And his voice sounds... I don't know how to explain it.\"\"Andraste Ruana! You don't say. I fought with her at the Battle of Vorstuga. She used some of the most powerful magic I have ever seen. Last I saw a demon grabbed her, turned into a dragon made of flames, and dispersed into thin air.  Word around camp was that the demon was her lover. Man, that campaign was crazy.\"Silas leaned his chair back, \"Now that I think about it, I don't really have any hobbies either. When I was younger I hunted or practiced with the sword for fun.  Now those two skill keep me alive. Perhaps you could bring me around the Enclave some time. Learning more about magic could be fun. And would certainly help keep me alive. I'm afraid I don't have any skills that you'd be interested in.  Unless knife fighting excites you?\"  ", "1493097247000": "Silas couldn't help but smile when Skarlet admitted to finding fighting exciting.  He saw a familiar glimmer in her red eyes, \"Nothing wrong with getting carried away, as long as you don't put yourself in danger. Not that I condone meaningless violence, but there is something satisfying about close combat with a concealed weapon. The attacker thinks they have you but all of a sudden a chunk of their forearm is missing.\" Pausing, the mercenary flattened his clothing so that the bulge of his hunting knife would show, \"Knowing how to use a knife is like secretly possessing a power that can keep you alive in a pinch. Almost like magic.\"It seemed that Sarlet was one to become squeamish, so Silas was not worried about getting a little passionate about his dangerous profession. Not wanting the date to end, \"Would you like to move elsewhere?  There must be something exciting for a young pair to do on an Israin night.\"", "1493164308000": "\"A walk is always enjoyable after dinner. I don't mind where. We can admire the city at night or find a quiet spot in a park where I can show you some tricks.\" Silas would like some alone time with Skarlet. Perhaps, he could learn some of the secrets that she kept hidden from such public places. ", "1494293585000": "Some time after the Prospernalia Silas waited in the Midnight Sun's bar to find Skarlet. His cloths were now much finer than the one he entered the city with, but he did not come off as gaudy.  The new cloths fit much better now and Silas found the touch of the fine material to be much to his liking. His hunting knife now rested in a leather sheath at his belt. The spear he had acquired was accumulating dust in his room and the mercenary was considering ending his life as a sell sword and finding a real job in the city.  Although, the freedom of an open road was not yet forgotten.Opposed to what his fine close suggested Silas was totally out of cash.  He would have to ask Skarlet about finding work.  In the meantime he wanted to go on that date to the Citadel that Skarlet had promised.", "1494446841000": "May 8, 2017 20:03:11 GMT -8 Skarlet said:\"Hello Silas!\" Skarlet found Silas  and took a good look at him, he was looking much cleaner. \"You're looking dapper today, did you want to check out the Enclave today?\"Skarlet was dressed in civilian clothing, since she came to find Silas not work. Her hands were held behind her back and she swayed, her hair was back to it's usual style.\"Exactly what I had in mind.\" Silas noted the lingering stare that Skarlet gave him, \"Except, I was hoping to catch you in your work outfit.\" Silas had only payed for a few more days rent in the Midnight Sun and had no money to speak of.  A half stale piece of bread was all that he had for breakfast, but it would hold him. Later in the day Silas would ask Skarlet about where he could look for work.  Silas led the stunning young women to the door and held it open for her, \"Lead the way, my dear.\"<Exit>", "1486457846000": "On his way back from the eastern bridge Silas bought a new set of clothes with the money he had earned. He hoped he was not too late to meet Skarlet at the Midnight Sun.", "1493842513000": "\"Stick 'im in a long boat and make 'im bail 'er, early in da mornin'!\" Silas finished his last verse to the time old sailors shanty.  Because of the tankards stuck to the drunk fools feet, he was forced to take longer strides. He made a clopping noise as he loped along. The whole affair would look like a crude imitation of a horse, with Badger the gnome riding atop. \"And that'sh how I got out'a the battle of New Brimshdale. Hic. Someone else give us a song!\" It was a moonless night.  Only star light led the way. Silas had a dim idea of where he was going, drawn by a large black shape in the night sky. ", "1494448151000": "\"Lo, the Wanderer, the Most Holy, and all the gods of Medan fuck us, but that was scary!\"  Silas, cursing all the gods he could think of, had sobered up considerably after the encounter in the tower, \"I mean, what the shit was that thing? I thought for sure that the Dragon Spire was abandoned.\"Pad, clomp, pad, clomp.  The mismatched shoes on Silas's feet echoed though the empty streets. His nerves were so shaken that he hardly noticed.  \"What say we climb the Citadel instead?\" Perhaps the man had not sobered up entirely. Badger might be game for such an adventure, but hopefully @kiera would have better judgement.", "1494733367000": "\"I suppose your right. I have a better idea! Lets climb this building.\" Silas pointed to the book store that they were standing next to. Perhaps there was a drain pipe, window ledge, or ally wall they could climb upon to get access to the roof.\"What do you think, Badger, can you scramble up that pipe? Or do I have to lug ya up there?\"", "1494829381000": "\"Go for it Badger. I'll catch you if ya fall.\" Silas gave the little gnome a lift to get him started.", "1494046318000": "When Silas kicked down the wooden door the tankard on his right foot shattered.  As was proper for drunkards and tourists alike, Silas had chosen to climb the highest neighboring towers, \"Ups we go!\" Silas beckoned to @kiera and started up the spiral stair case. Badger was still perched on Silas's shoulder, but he did not seem to notice the extra weight. Perhaps it the Immediate Regret that kept the overly inebriated fellow going.The staircase led to a large platform that over looked the city. Much of it was dark, but light still glowed from the citadel, \"A golden view for the Meridian Gold!\" Silas chanted in a sing song voice as he waved the bottle of wine. He sat down with his back to the wall, \"Shyiit.  Ain't got no cork screw!\" Silas took Badger off his shoulder, then went to take his boot off.\"The fuck? What's this tankard doin' on my foot? No way it's been there this whole time?!\"", "1494048246000": "\"Ahh, that's uh er umm... Th-th-the the. W-w-welll you see... I... Um.  I-I-I was...\" Silas pissed himself and sunk to the floor, expecting to die. \"We brought Medanese Gold.\" Silas offed the fine bottle of wine in a last ditch effort.", "1494447174000": "Badgers diplomatic words almost made Silas offer to fix the door. It was @kiera's rationality that made him choose to run.  Silas scooped up Badger in a fireman carry and bolted for the door.  He did not stop running until he was safely back in the streets of Isra.", "1494454054000": "Silas paused at the Citadel gate.  In a sudden flash of déjà vu, Silas had the urge to climb the stone walls.  He shook his head to wipe it of such a foolish thought. \"This is quite the construction!\" He said in awe.", "1494530147000": "\"Nothing bad happens?\" Silas felt very out of his element here, but still he was having fun, \"Like an alchemical explosion? That would be exciting.\" Silas kept his voice down so that none of the mages would here him. He wondered what, if anything, he would learn here.", "1487384201000": "Although he was no tracker, Silas knew how to walk softly. He carried his new spear over his shoulder.  The weapon well made. The shaft made of hardwood and head of good steel. It obviously had belonged to one of the Isra guard, but no one had said anything about him taking it. Silas supposed it would be OK given the circumstances. There had been little time to ask for armaments at the beginning of the mission. \"Easy enough.\" Silas responded. The plan did seem rational. Without mages Silas supposed a controlled fire could have done the trick, but mages seemed much more effective. This job was looking to bring some easy coinage. Idly his thoughts shifted to his upcoming date with Skarlet. ", "1546476138000": "It was an old road, a decrepit road, that the crippled man traveled. Upon exiting the shadowed forest the man quickened his pace, uneasy at being out in the open. These lands were well known to the traveler but he had no solace in that fact. Sure, there were some happy memories here most ended in sorrow. Leaning heavily on his cane the man did not even seem to notice the guard tower as he passed.", "1483924360000": "Silas had decided to bypass the battle that was brewing in New Brimiarde.  He had thought to seek his death on that field, but that would be too mercyful for one such as himself. No, he would live and stone for his crimes.On the way east Silas had stollen some new cloths from a wash line. He didn't like to steal, but liked wearing rags even less.As Silas crossed into the Free Planes he thought idly of his last visit to Isra.  It had been a pleasant time.  He would have to return to the Midnight Sun, for what a wonderful establishment that was.  The food was good and rooms affordable, and there was a particularity alluring serving girl, if Silas remembered correctly.  Another pretty women flashed into Silas's mind, accompanied by a twang of guilt. The seamstress with the magic boutique.  Silas lamented the loss of the coat he had bought there, but...Well Silas would not dwell on that time.", "1485753367000": "\"Holy shit.\" Silas and Ambicat Guess seemed to be of like minds. As the little man jumped into action Silas decided to follow his lead. First thing he did was take a spear from a fallen soldier. Relying on Ambicat's commands Silas began helping survivors to the safety of the guard. As he worked he scanned the area for bugs. Most of them had gone. He asked one of the other mercenaries, \"Think we could catch one alive?\"", "1486254635000": "\"I'm not sure cowardice applies to a bug.\" Silas joined the group, resting the unused spear on his shoulder. \"The survivors might know why they attacked. Are we going to follow? I sort of have a date tonight...\" Silas didn't like the idea of following the giant bugs into their domain anyways.  This was a delicate matter that would require well trained soldiers and specialist.  ", "1486590083000": "\"Well, I wont be out done by a someone who fights in a dress and a halfling. And I can tell we are going to be great friends.\" Silas nodded to Hiyama , then knelt down and extended a hand to Ambicat Guess , \"The name's Silas.\" ", "1486772045000": "Silas squinted at Hiyama momentarily, then shook his hand humbly for he knew it was not the custom in the east.", "1539146740000": "Not being able to bare the painful memories that clung to the city, Silas had left Isra in search of some diversion in his remaining days. As his leg had been broken so too was his soul shattered. Death, loss, heartbreak; these emotions he carried openly. They were chains of remorse that clanged sorrowfully for all to hear, but were all that connected him to happier times. Such feelings had faded into the static of his subconscious, keeping him alive in the face of a much more sinister prophecy. He was a doomed man and he knew it.Perhaps he could have avoided the curse if he had lived his life differently. There were time that he should have made a stand or kept true to his beliefs, but he had always sought the easy way out. Well nothing was easy now. Not even walking from the door to the bar. Having grown cynical to things of beauty and magic he endeavored to cling to his melancholy. Sadness what all that kept the fear at bay. After a few stiff drinks Silas turned to whoever looked like they might listen, \"You know, it all started for me in a place like this. A magical forest. Bar on a dirt road. Heh! I've been walking around in circles my whole life. Limping now.\" He struck the floor with his cane. Leaning the chair back on two legs he used the finely carved stick to help balance. \"Ya know,\" His tirade continued and did not seem to become more sane, \"I'm a dead man walking. The name's Silas, but you'll probably never use it. I'm just some undeveloped character written out of a play. I'll die off stage and the audience wont ever know I was gone. I'm cursed I tell you. If I weren't such a coward I would end it all now. Tried once, but even that didn't work. Cursed to live and cursed to die. Heh! But arn't we all?\"", "1539149342000": "“Oh, uh. It's good of you to ask.” Was this man really going to engage in conversation? Silas had grown use to most people ignoring him in his pitiful state. “Let me buy you a drink! Whatever ya like.” Anything to get the man to stay longer. “The curse, well…” Silas shivered as terror crept up his spine, “It all started in Isra, well perhaps before then, I don't know. These three weird priests told me my fortune. They knew things. ALL the things. My whole life. And they told me something was coming...coming to claim my soul. They said it was linked to their quest and that is why we had crossed paths. I didn't believe it at first but that night I knew something was watching me from the shadows. I think I would be dead already if it weren't waiting… waiting for something. I don't know.”Not wanting to off put this Julius to soon, Silas made an attempt at conversation, “So uh, you like books?” As was typical of those who fell into madness he quickly brought the conversation back to himself, “I was once quite the reader. Oh the things one can learn from books. Ask me any questions about this world and I bet I've read about it somewhere. Go on…”"}