{"1451642631000": "This shop, St. James Boutique the sign read, was far easier to access.  That was lucky for it had a very strong magic signature.  Trogdor landed nimbly in the streets.  Still the window panes shook a bit.  The shop was clearly occupied and since Trogdor was not quite ready to be kicked out of the city he decided not to destroy Boutique in his haste.  Instead he lowered one eye to the window and peered inside.  \"I seek a magical item...Anything will do.\"  Trogdor's motives were very plane.", "1451811786000": "\"Ha!\" A derisive bark. \"A dragon in a dress.  How ridiculous.  No, I seek for items of value.  A bright and beautiful object. Something that will inspire envy in the hearts of others.  I want a piece worthy of a dragon hoard.\"The smell of enchantments filled the air.  It was a gloreous feeling for a greedy dragon. He eyed the women more closely. She was beautiful, for human standards.  Her poise was that of a strong and determined women yet she did not act brash as humans so often did.  Interest in his tone Trogdor adopted a gaulic accent, \"Me dire Geneviève Saint- James, êtes-vous l'enchanteur qui a fait tous les vêtements dans cette boutique?\"", "1451857186000": "An excited little girl poked her head out the window.  Trogdor having never seen a human child before sniffed her curiously. She smelled of sickness.  Trogdor had certain healing abilities but would not offer any help.  The mother, being apparently well off, would have taken her girl to a healing mage if it would have helped.  If this girl had a disease incurable by magic she would most likely suffer an early death.Returning his attention to Genevieve Trogdor switched back to the common tounge, \"You don't seem to excited about this sale?\" Trogdor had of course expected to be gifted with something.  He was not above a little bartering however...as long as negotiations remained pleasant. \"Gloves or a hat? Tell me more. If I am intrigued I could show you something interesting.  Or perhaps there is a somewhere or someone you want to see?\". Trogdor thought of the skrying mirror he had just found. Trogdor was irked by the new comers easy goingness.  The taste of Shaun's blood returned to the dragons taste buds.  ", "1451858428000": "\"I would not harm your little one.\" The dragon said reasuringly. He was not trying to cause any commotion he just wanted something for his hoard.Trogdor withheld his anger at being interrupted by Kate and spoke to her.  \"It must be the holy dragon you speak of.  What do you know of her?\"", "1451874599000": "\"And what do you think of a dragon that walks on two feat in a human form wearing cloths?\"  Trogdor shot back now growing annoyed at the irony of the situation.  He was not the dragon that Lum had been searching for but he did not comment on that. The dragon lowered his head closer to the impetuous girl. \"I came here because of the rather strong magical aura that radiates from this shop.\"  He opened his mouth and tasted the air.  \"Even the door has an enchantment that effects those that enter. A helium brained human such as yourself might not notice that the item you get here are not normal.  You could walk out with a sock that makes you kick yourself in the rear every time you have a bad idea.\"", "1451896409000": "The dragon had turned angry.  Through no fault of their own the humans had pushed Trogdor pretty close to his limit.  They did not know about Trogdor's previous encounter with Giplor. They were unaware that Lum's comment about dragons using human forms had hit a soft spot.  Nor had they witnessed the dragons in the skrying mirror, again on two legs.  How could they know what made the red beast angry?  Dragons these days had grown so familiar that humans had lost respect.  Trogdor had attempted to act civil but had been treated with indifference.  When the pink haired girl turned her back a large gaping jaw lowered directly behind her.  Ready to snap.", "1451938412000": "The situation had gotten out of hand.  Yet although Trogdor was seething in anger at the oblivious Kate the quick intervention of Genevieve stayed the dragons teeth.  And thankfully so, for as Trogdor observed the pink girl falter her way through another social encounter he began to view her in a new light. This human was oblivious to everything!  His anger now dampened to only slight annoyance once more he continued his dealings with the Genevieve.Or at least he would have if some old hag hadn't butted in.  Irrational anger flooded the dragon once more.  He had never responded well to authority, especially when it was administered in such and aggressive matter.  Genevieve, a rare gem of rationality, was able to calm Trogdor once more. Stroking the dragons ego did wonders for negotiations.He sniffed the dress, attempting to unravel the enchantment it held. Oddly, he was not able to pinpoint what it was the dress did.  It's magic was such that it was tailored one person in particular.  \"Your magic is complex.\" Almost a compliment. \"I'll take the mannequin too.  If the owner of this dress ever comes by you will send them to me?  It would be a shame for the two to be separated, Non?\"Trogdor turned to the grandma and gave her a level stare.  \"Just a casual business transaction...Is it illegal for dragons to shop in this city?  Would you like me to desist my purchase and cease my payment?\" Trogdor emphasized the two verbs to illustrate that they meant the same thing.The dragon might have left without paying but over all this had been an enjoyable experience and he had mentioned compensation.  Turning back to Genevieve he asked her once more, \"If there is a something, someone, or somewhere you would like to see simply speak the name.\"  Trogdor opened his mouth and let a large tongue lull out.  On it was the scrying mirror.  Fueled from Trogdor's own mana reserves the crystal relic shone brightly.   Rather than her reflection Genevieve would see a ethereal swirl of mists.  Imbued with so much magic the mirror would almost seem to be a door way.  Trogdor himself could not have viewed the mirror in such a state.The choice was Genevieve's, she might not even have anything she wished to reflect upon.", "1451965216000": "Trogdor pulled the mirror back into his mouth and concealed it under his tongue once more. \"You have been so gracious I will let you take a rain check.\"  A rare offer. Gingerly he took the coat and mannequin in a foreclaw and held it close to his chest.The dragon hardly listened to the old women as she droned on.  He was starting to realize that most humans were fairly stupid. \"Blah blah blah.  You and what army, bitch?  I am Trogdor the Beast of Pharoah Zaltos Kiraxo.  You had better hope you never find yourself in a serious business deal with me!\"  With that he leaped into the air, pushing off a near by building for extra speed.  Two large claw marks would be left in the court yard and a piece of the buildings roof destroyed.  For a final farewell Trogdor bellowed a roar and let out a gout of flame.  With that he began his flight back to the Phoenix State.", "1449221426000": "Trogdor alighted upon the dragon spire.  \"This structure is very convenient.\"  The dragon said to himself, almost begrudgingly.  He padded to the edge of the platform and lay in the sun intent, for now, to enjoy a quick nap.", "1449671637000": "Trogdor woke from his nap.  He was a bit disappointed that no one had come to visit him. C'est la vie. Thought, the dragon as he arched his back in a massive stretch.  He unfolded his wings and stepped off the spire, falling into a lazy glide.  Trogdor rode the winds over the city, looking for an interesting place to land.", "1449770437000": "Trogdor glided far above the citadel. He admired all the fine metals of the buildings roof.", "1517479885000": "Out of the forest stepped a tall figure with elven features. Clad in armor and draped with a cloak, only the man’s face was bared to the world. The sight of Jun the mage, a known dragonslayer, did not please Trogdor. A dark and evil magical aura accompanied the transmogrification and there was certainly nothing funny about it. It was an unstable power exemplified by an incomplete transformation. As the elven figure drew closer the awaiting Israins would see the armor Trogdor wore shift from ornate finery to red scale and back again. Viewed from the peripheral vision the cloak became dragon wings and gauntlets became claws. Yet, when focused upon the features settled into a humanoid anatomy.Trogdor stopped five paces from the Empress he had come to speak with, “You do me great...honor,” Red eyes snapped to Jun, “To bring such a powerful mage as your escort.” The tone of voice was low and words crisp as if being bitten off. Erect and stiff, Trogdor stood like a statue, motionless in its singular form. Rather than move and shift as a person would, the dragon’s humanoid form continued to waver. The beast within wanted out, but it was repressed.Rancid magic emanated from Trogdor like a bad odor. The energy could now be sensed spewing from a sheathed dagger. The decaying mana within the capture blade might be familiar to Jun. It smelled of wasted benevolence, corrupted purity, and deadly rot. It burned at the senses like heat from a fire that is far enough away to make the cold feel colder. Uncomfortable as the environment may be, the dragon had no intentions of attacking. Today was for talk, “I come to propose an alliance of sorts. During my time in these lands, my goals have been thwarted by a disagreement with humanity. Once, it was prophesied that I would make you stronger. Again, I was warned that death would take me if I did not change my ways.” As the dragon spoke scales began to creep up his neck and flair around his head. Trogdor’s mien locked into Naoki’s stare revealing his anger, pain, and most of all suffering. Shining brightest in the red eyes was the gleam of desire.“You cannot understand the depth of my want… my need. You think me a beast. I am one. But I have learned from my errors and now come with an offer instead of a demand.”", "1517714665000": "Dark and bright magic met in a surge of power. The turning of the leaf sent a ripple across the bordering edge of the contrasting energies. If Jun were to push the boundary of her aura she would find that her magic would consume the black mana amplifying her own spells. Should she pull away the dark energy would follow; expanding into the void and growing in volume and magical potential. In this way, she could indirectly manipulate the darkness to her own desire. The corrupted mana was disgusting to behold, yet it served as a righteous fuel to make pure magic stronger. Opposed to being eaten, Jun was fed.“It is ambition, Empress. I do not confess to know you, but I suspect on the surface our desires are not so different. I wish to be feared if not respected. As a dragon, I need this or my pride will not be satisfied. Fear does not bring respect. That is clear. So I have come to you… a higher authority, to ask for a piece of your power. In exchange, I will give you mine.‘I want the city of Stonevale. Give me governance of the capital of the Meridian region and I will deal with the dark forces that seek to do harm to Isra. Though our union we will influence the balance of good and evil and work it to our advantage. Let us prosper together.” Trogdor kept his tone level as he spoke. He remained truthful so as to control his emotions. How the Empress responded at this critical moment would strongly affect the dragon’s temperament.“Asking such a thing for free would be presumptuous. In exchange for control of Stonevale, I will deliver you one million gold coins of ancient mint, tonight.”", "1518164444000": "Just that fraction of an inch was enough to flare the mana even more. Where the human and dragon auras overlapped a sheen of light appeared in a soft corona effect barely visible to the eye. Unused magic was now heavy in the air making the environment feel muggy and warm. Magic continued to leak from the tanto at a steady rate. It was the half-life decay of a broken soul. The black mana pooled like the oily black substance that sometimes bubbled out of the ground. It was smelly and easy to ignite.Yet the magic sat there motionless and without direction, getting stronger all the while. If Jun wanted to she could reach out and take it. Use it. Hold it. In fact, the aura wanted to be released, if want to could be attributed to such a dead thing. Its power was vast yet constrained. Mighty yet reduced. Overreaching and imprisoned. Once freed, however, it could be unstoppable.“I would give succor to those wretched few who all others have alienated. There are many creatures in these lands who are trog upon by mankind. Just recently, another dragon destroyed an entire camp of kobolds, goblins, and gnolls in revenge of one tortured human. Regardless of crimes committed this is wasted potential. I seek the authority to govern fertile lands where such creatures do not have to conform to the laws of humans. A place where they are protected from blind retribution.‘I would not have my people threaten the solemnity of your civilization, however. It is through my authority imbued by you, Empress Naoki, that I can exert control over the beings of darkness. For without your power I offer naught but fear.” Trogdor was more willing to talk then Naoki might expect. He certainly did not want any tea though. This atmosphere was more to the dragons liking. The beast paid little attention to the armored guards who clinked in the background.", "1518328963000": "Staring at the tanto would reveal a depth to the blade. Beneath the sheath, blazing upon the steel was a melted rune that was now unreadable. Within the cold steel was imprisoned a power that was far greater than that of the outer aura. The miasma that Jun had felt was only the overflow of the source within. Buried deep within the vessel a small flame burned like a burning coal, hot, but destined to die. Minutely perceptible was the desire to be unsheathed so that the blade could ignite a new fire. But Trogdor would not do so, and the power would be left to smolder. Still the residual heat was strong and dangerous to manipulate, though perhaps not so difficult for an experienced holy mage. Excess mana continued to seep out of the blade, spreading and edging around Jun’s aura. It was not aggressive, the magic was free to use by anyone. The mana moved fluidly from areas of high concentration lower areas. With the abundant power in the air Jun likely had enough to blast the compressed dragon to oblivion, cursed knife be damned. She could at least get rid of one villain in the name of the law of this land. The dragon was not worry about a breach of peace from the Isrians however.Trogdor did not know the inner thoughts of the Empress, but he could sense the change of mood. His words came from the mouth of a beast and Naoki was right to be disdainful. Yet, the Empress's sentiments were wrong on at least one account. Trogdor was cruel and because of this, he saw no value in pity. Monster that he was, Trogdor cared only for power. Bandits killed was power lost in the eyes of the dragon. It was wasted potential for them to kidnap humans and torture them. Such inane violence was worthless. The difference between a bandit and a soldier was the principles of the force that governed them. Trogdor needed to show the Empress that he was at least lawful, if not completely pure of intent. For it was with law, that true power lay.\"Isra is a free land where all who abide the rules may live equally. Through my rule, those who you deem dangerous will conform to the laws of civilization. They will not simply be forced into cooperation. They will do it because society must evolve least it destroy itself.\" Trogdor paused here to give weight to those words. It was imperative that the Empress understand that despite the darkness in Trogdor's heart he strove for unity, if only for the sake of greater power. Like his lust for gold, it was greed that motivated the dragon. The beast could be called evil because nothing would stop his desires. Perhaps, Naoki new this about the dragon. Surely, she knew that the beast was motivated. Was it possible that she goodness came come from evil? “The current citizens of Stonevale are part of an old society. That land and its people should not be disrespected. If new creatures are to inhabit their land it is only right that the people of Stonevale should be elevated in status. There are goblins, trolls, and orcs that wish for fertile lands to farm. Let them farm the land and the humans can reap the reward. Even the poorest human will be raised to the middle class, where they can benefit the economy by becoming traders, entrepreneurs, and philosophers. Once all creatures can live together the creative potential is unlimited.” In Trogdor’s mind his kingdom would be a utopia. A beacon by the sea. Though Naoki might have known the right of it. Vanity blinded the dragon to the dystopia that was inevitable for some.", "1519118482000": "“I could agree to certain terms,” Trogdor said tentatively, “You now know my intentions; the lengths that I will go to reach my goals. That dragons...That I, should be respected and feared has always been my desire. Will Isra sanction my actions in the Open Lands? I would give you my power when called upon, but in return, I ask but one thing. Give me one day to confront the statue of Zephidel on Stonevale Beach.”Trogdor paused to hear Naoki’s response. It had not been hard for Trogdor to let go of Stonevale. That city had never been his to begin with and the desire to rule shimmered only faintly in his black heart. His real infatuation with the place came of his meeting with Zephidel on the first day he arrived to this land. Lord Zephidel had not been seen for a long time and Trogdor now sought to destroy his last traces.If this small request could be accepted Trogdor would make a further proposal, “As to me lending you power that too comes at a condition. I must know what kind of power you can give me in return. Perhaps a small duel between me and your mage would set an adequate standard. I believe the stage is already set.” With the last words, Trogdor turned his gaze towards Jun, “If I win you must serve me.” Just as when they had first met, the spell that transformed the dragon into a man wavered. The beast preached on as a dark look came over his face, “Too many times have I been controlled or manipulated to be bound once more. Still, my power would be greater if I could bind a mortal to my will… If you agree you can, of course, ask a prize.” The dragon had seen Jun eyeing the tanto he wore. In fact, he knew that the blade might have appealed to her. Giving no notice to the guards Trogdor was already reaching for the dagger at his side. The power around him was hot. It smoldered brighter like a bed of coals about to burst into flames. ", "1519589969000": "The dragon had now been scorned in every way possible during this meeting. Hs offers had not been accepted and the Empress had only led him on so that she could respond with denial. Now the mage too would insult him. In his own way, Trogdor had asked Jun to become his rider. She had taken the offered power and thrown it away. It seemed that by attempting civility, Trogdor had only made his defeat easier. A typical politician, Naoki had talked without saying anything. She had avoided the questions of sanctioning the dragon’s actions and offered nothing in return for his power. The statue would only have been a symbol of their agreement and was certainly not enough for Trogdor to give his allegiance. By denying the dual Naoki showed that she was not tolerant enough to control this dragon. “What deal?” The beast sneered. “Strength and gold is all I have to bargain. I have offered you everything and you would give me nothing. We have nothing left to discuss.” Trogdor turned away from the Empress and would acknowledge her no more.Focussing again on the mage he said, “In the interest of this not being a complete waste of our time I offer you this evil blade. It is time that the terrors of our past be completely forgotten. Perhaps you will deliver me the statue of Zephidel so that I too can forget. But I have come to expect little.” Trogdor threw the sheathed blade to the ground at Jun’s feet. “Take it, leave it, or return it to me at another time. I do not care. In a few days, I will send a kobold named Oobie Doobie to repay a debt I owe in Isra. You can speak to him if you wish.” Before leaving Trogdor scooped up the bird’s nest. Within were two eggs that could still be saved. At one time the dragon had spoken the language of all creatures. This ability had been lost due to insanity, but the dragon still had some capacity for affection.", "1430838326000": "The murder passes through the sky like a black cloud.  A shadow, which seems to suck light rather then obscure it, follows beneath.  The crows descend upon the field and begin to feast on the dead.  Flesh is torn and blood runs anew.  The smell begins to worsen and the squabble of birds fighting over tasty eyeballs fills the air. Those crows that have satisfied their hunger perch in the tree's, watching the human survivors.  Those who observe these creatures may confuse them for ravens, for they are much larger then normal crows.", "1430982753000": "A large raven, 4 feet tall, stares at Jarkoopi.  It keeps it's distance and follows.", "1431828045000": "Still blinded and consumed by a seemingly endless amount of rage Trogdor crashed through the wilderness. The dragon had already exhausted it's molten breath and was simply wading through the forest with its claws, flattening hills with sweeps of it's mighty tail. The once noble features of the dragon were now marred. The right side of the face was blackened, burned to the scull. There was raw patch of tender skin that was slowly scabing over a burn on the right leg. A black streak of scorched scales spread down the dragons right side. The smell of smoke and glow of fire had drawn the mighty beast towards the free plains. Crashing out of the forest Trogdor raised his head to the smokey sky and lets out a roar. As Togdor's inner power and rage was powered by the burning of all other emotions his roar was thick with pain and sorrow. It's noise would cause those who heard to feel the pain that Trogdor could not feel. The dragon's one good eye rolled manically trying to see everything. Sensing a powerful entity admits the flames the dragon prowled forward. Trogdor's head bobbed back and forth, his left eye still rolled in it's socket, and there was a slight limp to his right leg. Trogdor obviously did not come in peace.", "1431835271000": "Trogdor heard the message.  He did not respond but heeded the advice in his own way.  As the beast entered the flames he sucked in the hot air and began to summon wind.  He was attempting to suck in the wildfire and what ever entity was controlling it.", "1431915234000": "Trogdor's anger built as the phoenix (if that's what it was) taunted him.  He responded by drawing on more mana as summoned wind and air to himself.  He began creating a pressure dome above himself and the flames, attempting to trap whatever was inside.  If the Trogdor could only consume the fiery power before him he might be able to find respite.  The words in his head had mentioned following besides the phoenix, but the dragon, in the depths of his anger, was unable and to reason.  ", "1431969815000": "Trogdor drew upon his anger, his black mana. The sky began to darken as silent storm clouds gathered. A black wind fell from the sky and was added to the pressurized dome of air Trogdor had been gathering around the wildfire and all within it. The sound of wind complimented that of rattling chains.  The dome, swirled with black and fiery streaks, began to shrink. What remained of the heat would be condensed and drawn towards Trogdor's jaws. The dragon's only intent was to consume this spirit that was trapped within the flames.", "1431986124000": "Fire! Life!  Trogdor sucked in the amplified flames that had appeared in his mouth and consumed their power.  Trogdor's anger burned hot, but the profits flames were hotter.  Trogdor's anger, his dark mana, was consumed by the golden flames.  The corruption that covered the dragons mind slowly began to dissolve.  Feeling the release Trogdor ignored the other chains on his body and concentrated on drawing in more of this profits power.  The pressure dome continued to shrink and compress, making the area in which the fire and the profit existed smaller.However, as the corruption burned away a black smoke began to trickle out of Trogdor's mouth.  It sunk to the ground, killing all plants that it touched.  Unless this deadly gas was contained it could cause a serious problem.", "1431999530000": "A rational or sane mind would have responded to the prophets kind offer.  Trogdor was insane and lacked the will power to heal himself.  If the prophet thought to gain control of the dragon through force then it was unaptly named. The once might beast writhed pathetically, chained to the ground, attempting to break free.  His one eye whirled manically as he drew upon his dark mana.  The dragon's hateful strength was growing.  He raged at how easily he had been defied in Stonevale.  Raged at the tiny wolf that had ripped from him his tongue and wing.  Raged at the demon that was now squeezing the life out of him.  He raged at his own weakness at not being able to defeat a single foe on this continent.  Chained to the ground, unable to move, speak, see correctly, or even think strait Trogdor did the only thing left to him.  He devoted all his mana to shrinking the pressure ball, now trying to crush the spirit within, and summoned a storm like none ever seen before in this land. Dark clouds had already gathered.  They now began to condense together forming a black blanket over the land. The clouds directly above the dragon began to spiral, awaiting the beasts likely demise and thus environmental diffusion.  Trogdor, who had lost everything in life, would show the world terror with his death.The only thing that would free Trogdor of his rage was it's forceful removal, or a fire that could burn hotter then the dragon's hate and consume the black flame within him.", "1432016352000": "The storm began to lesson and Trogdor began to subside as the anger burned away.  The pressure dome dissipated and soon all would return to normal. ", "1432056313000": "Pain filled Trogdor, spreading from a migraine that split his head. In the dragons head chemicals balanced and mana pathways reopened. This reaction was catalyzed by the golden flames.  As this happened a black smoke began to seep out of the dragon and collect into a small cloud above their heads.  As clarity filled Trogdor and the pain began to lessen he reached out with his mind and controlled the winds to speak for himself.\"My mind is free, for that I thank you.\"  He stood painfully on his broken ankles.  \"With the loss of my anger feelings of revenge are gone.  There is only one being that I seek now, out of ambition.\" Trogdor focused his eye at the now solitary black cloud in the sky.  \"Have you any powerful gems that could contain this evil?\"", "1432084808000": "\"You seek to bond me?\" The wind whispered as Trogdor limped a circle around Zaltos keeping his one intact eye on the man.  The red and black creature growled as it observed the man. \"Do you expect me to be grateful to you?  What have you to offer me in exchange for my power?\"", "1432247036000": "\"Heh, get on.  I need a stretch.\" Trogdor unfolded his healed wings and dipped one to the ground so Zaltos could climb to his back.  When the man was on board Trogdor would leap into the air and flap to the plateau with only a couple beat of the mighty wings.", "1431656342000": "The raven follows Jarkoopi to the cave but dares not enter.  It perches on a pile of rocks in the entrance and sits there completely motionless and quiet.", "1431668301000": "Squawks, \"Go back!\"", "1432315040000": "\"Wait!\"  The Raven hopped off the rock as it was swathed in electricity.  \"Please!\"  The bird made no attempt to run.", "1432489439000": "\"I am a slave to Trogdor!\"  The bird squawked. \"He controls me with dark magic.  The spell gave me sapience as well.\"  The bird started flying away.", "1493006098000": "Magic lay humid around the Storm Bringer's lair. Trogdor's nostrils flared as he glided around Mt. Indra, picking up the scent of magics old and new, from many sources. Predominant were Jarkoopi's own weavings. Undaunted by the dangers, the red beast landed many yards from the entrance of the lair of Jarkoopi, Kepesk Altiui .Trogdor growled into the wind, \"Rocen sia thurirl. Wer wold ui thirkuir vur coi ui tairais yth tawura ulnaus.\"", "1493185124000": "Trogdor maintained his distance from the cave. Acting in such a passive manner was unusual for Trogdor, but recently the dragon had begun to see the world in a new light.  For the first time since he had first been driven from this land over 1000 years ago Trogdor's mind was not clouded by revenge. Instead he held a more rational concept of his reality.\"Irral, si tepoha confn ekess yenta bivai.\" Even given his new outlook those words were hard to say, \"Last time we met I was blinded by anger. Zaltos has left me as broken as I was before being drawn to his power. Even now magic is beyond my grasp. I came to this land seeking to reforge the might of the dragons, but was instead corrupted by human folly. Now, you could say, I have seen the light. Times are not so different. The humans still want us dead. They have taken your land and my pride. I have reason to believe another of our kin has also been slain. Come, Storm-Wing, let us unite so that we lose no more to these mortals.\"", "1517730686000": "Above the screaming village came the beating of wings. A gout of fire illuminates the night. \"Show yourself demon!\" Trogdor roared as he landed at the edge of the town. ", "1517812247000": "A spout of fire bursts from the dragon's mouth as he burns a swath in front of himself, warning the spiders to come no closer. They might find that the fire was hotter up close. As the ground burned before the dragon, the beast began to growl in response to the laughter. He decided to continue warily because he did not yet know what kind of demon he was dealing with. Expanding his aura he searched the surrounding area.\"I sense a demon from the rings of hell. From what circle comes my... much welcomed guest?\"", "1518160272000": "The dragon surveyed the demon as it burst out of the shadows. She was certainly ancient. Her power smelled of deep and old magic. Something primal and full of bloodlust. Trogdor felt an immediate likeness with this hell dweller. But likeness did not necessarily mean kinship. That was yet to be seen.\"Someone capable of sensing me.. How curious. Are you powerful?\"The beast laughed, “Huk, Huk. Can you not tell? Or did you mean to challenge me and find out?” Trogdor stood on his hind legs and spread his wings. A fire burned in the dragon’s chest and smoke billowed from his mouth as he spoke, “Know that I am Trogdor, the Ashbringer. You have entered my lands. I hope you have enjoyed the buffet, but I warn you that the rest of the Overworld will not be so accommodating.”", "1518161699000": "The dragon would have laughed again, but it wasn't wise to risk insulting such an ancient entity. \"I speak plainly. You may gouge yourself on this town. I have never claimed leadership over these humans. In the future however you meals may not be so easy or plentiful. There are many other demons, mages, and demigods that walk these lands. Many of them are quite fond of humans. But in meeting me you are lucky. After you eat meet me atop Mt. Grimm. There I will propose to you a much tastier meal then human flesh.\" With that Trogdor lept from the ground and flew back into the mists that shrouded the mountain. A flash of light could be seen as he discharged his fire breath.", "1546632029000": "The quiet town of Lux has grown even more silent. It is an unmistakable deathly lack of noise that is insulated by a layer of spider webs that cover the entire landscape. Should you hear the tapping of spindly legs, run! The arachnids that now rule these lands listen only to their demonic matriarch. The webs spread towards Mt. Grim but stop at the edge of the mists.  Another beast lays claim to these parts. All who visit, beware these lands, you never know what sort of monster you may meet.", "1519590848000": "Tall and imposing, Mount Grim's highest peak is forever covered by a magic obscuring mist. Though it is still possible to cast spells, scrying and observation magic are noneffective. At the highest peak can be found a small cave smelling of rotten flesh and vegetables. Inside are mounds of gold, jewels, and enchanted weapons and jewelry. Enter at your own peril for this is the lair of Trogdor and few are welcome.", "1519621752000": "A dim light filtered in through the cave entrance and reflected off a large pair of gleaming eyes. A rumbling voice filled the cave, \"So you have made it. And in good numbers, it seems. The leader of this expedition should be commended. Come forwards Solix.\"The troll, covered in scratches and bite marks, fell to his knees in front of his master, \"We have collected both hoards. But I fear the undead have infected me...\" Solix gave a brief summary of the journey. The dragon hummed with interest as he scrutinized the zombies, wondering how responsive they would be.\"All this sounds good. Even your plight, Solix, may turn to our advantage. But in such a state I can no longer send you to Isra. Which is the Kobold Oobie? Come forward and give me your perspective.\"Oobie Doobie", "1519897975000": "Trogdor’s cave had a rancid smell to the nose of a human. Decaying flesh warned other predators that this cave was inhabited. On the spiritual level, the mana that seeped out of the cave stank like an old cheese. It smelled of pride and ancient strength for it issued from the shredded soul of a demigod. The power of a phoenix burned at its brightest, a smidge of spice on the pallet. The corrupted souls of demigod, phoenix, and something of a holy nature were slowly dissipating within the cave, trapped within various artifacts that were not meant to contain souls. A cold wind blew that swirled the mist on the mountain. Though the mist normally suppressed magic, it did not affect the mana that oozed from the cave. The condensed water molecules suspended in the atmosphere were burned away causing a path through the mist towards the entrance of the cave. “Do you like what you smell?” The dragon spoke into the wind, his voice issuing from the cave in a whisper, “Have a taste.” Clanking jarringly upon the mountain silence a steel chain tumbled out of the cave. Within the stomach of Trogdor three souls had been combined and stored within the chain in a desperate move at perseverance. The whole spell had been held together by an enchantment that had made the chains unbreakable. Clinking continued to fill the air as the heavy links of steel began to shake. The souls within had some notion of what was to come.Arakhna", "1519972957000": "“What have I done to it? That is, perhaps, the wrong question. I have done nothing but cleanse the volatile stuff from my own soul. What has been done to corrupt this energy is a long, complicated, and probably boring tale. Though I would be willing to tell it. But you may learn something of that history through taste alone.”Upon examining the chain and the mana it dissipated, Eclipsa would find nothing in it that might try to harm her. It was simply a dark magic from an evil being. To say that it was corrupt only meant that it was unlike any natural form of mana. This piece was only a fraction of the source that continued to pour magic out of the cave. Sliver though it may be the power it held was great.", "1520069945000": "As the spider demon chewed flashes of memory revealed themselves for one last time…… A woman far too beautiful to be human sits in the back of a lavish carriage next to a very large and simple-seeming man. Ensnared in a spell the knight's eyes were glued to the beautiful women. But his attention was drawn elsewhere. The carriage has breached the top of a hill revealing a large mansion that was partially destroyed. Laying atop it was a red dragon with a white stomach speckled with golden flakes. It’s head was lowered to a human in a rough brown robe. He held three tarot cards before the dragon.Nov 28, 2015 20:27:17 GMT -8 Grand Komtur: Giplor Vauc'Tutt said:\"Trogdor! Why didn't you just land in the yard or at the Angelican Estate?! Did you have to do that? If you weren't bonded to Zaltos i'd have to knock you on your head!\" Giplor shouted at Trogdor, shaking his fist at him as he spoke.\"This is Trogdor. He is the dragon of the Pharaoh of The Phoenix State. He would never harm us, but he seems to be fond of wrecking stuff.\"Instead of responding, the siren sang in her native tongue.Nov 28, 2015 22:06:34 GMT -8 Nereida said:When she spoke, she spoke in Siren's Song, forgetting the warning that Giplor had given her. It was a beautiful song that drifted from her lips, as melodic as the ebb and flow of ocean waves on white beaches, as the sway of emerald seaweed in the warm currents.Both humans seemed to fall into a stunned stupor when hearing the music. As this happened the dragon quickly ate the priest that had just read him an ill fortune. The scene went black.In the darkness of the dragon's stomach, the artifacts that the priest carried were performing their tasks of preserving the dead man's soul so that his knowledge would not be lost. But the ceremony was interrupted by a golden fire, out of which appeared a shadow with icy blue eyes. Molten gold and silver along with enchanted gems and chains entered the stomach. Through the connection of their bond, Pharaoh Kiraxo twisted the priest soul and inserted his own energy. Using the spell that the priest had already been casting Zaltos began spreading the energy into all the artifacts and valuables that the dragon was consuming. By sacrificing a human soul the Pharaoh pushed the bounds of his mortality. However, the priest had managed to protect a bit of himself within the tarot cards, the last item he had used. Three cards in particular preserved the holy man.After her meal, Eclipsa would like sense the sudden appearance of a ground of small humanoid creatures in the cave. With their arrival was a significant uprising in the corrupted magic.", "1520221279000": "The dragon, however was not phased.  Much of the evil aura was coming from him after all. As the kobold came closer, Trogdor's bulking shape took form out of the darkness. “Ever since you collected my personal treasures from the Valheesius Desert I have tracked your progress. Using the Wanderer’s Tome was quite an impressive piece of magic. You completed the mission faster than expected so I redirected your teleportation to here. Now, thanks to you, all my lairs are magically linked.”The dragon lowered his head and examined Oobie closely with a large red eye, “Indeed, you have the potential to become a mage of renown. That book and the ring with it would be of great use to you. Take them if you desire… but that staff appears to be broken and unstable. It might be best if-”Before Trogdor could finish he was interrupted by a new arrival. Eclipsa had been feasting outside the cave before the dwindling Hunting Legion had arrived, but it appeared that the spider demon was not full yet. Ignoring the magical items around her the famished demon pounced on the nearest bandit. Instead of stopping Eclipsa he nodded his head towards Oobie, almost in consent. It would be interesting to see how Oobie the mage would react. More importantly Trogdor wished to have some inclination of Eclipsa’s strength. Her lack of awareness shown by attacking a guest in Trogdor's cave so quickly beskope of either foolishness or arrogance, both qualities that Trogdor could not tolerate for long in anyone but himself. Be this as it may, the fight would not be allowed to get out of hand. ", "1516873768000": "“Enough!” Boomed a voice from the clouds, ground, or perhaps just the minds of those who heard it. Upon the land where the Hunting Legion was located a pentagram began to form. The lines consisted of shimmering red light that not only exemplified the burning of the camp but caused it to increase. As the blood-colored lines thickened and flowed a dark aura began to emanate from the camp. The feeling in the air was the coldness of death personified; a reminder that all life will someday die. Putrid magic had been used to cast this teleportation spell. The voice came again, “You have what you have come for. Now leave.” The voice spoke in a low tone. It held a soft yet harsh resonance that bespoke a resolve to kill if disobeyed. This situation could end now or continue to escalate until it became something more terrible than the everyday banditry that the golden dragon was so used to witnessing. Who knew what could result from the unexpected meeting of two dragons?", "1517390266000": "Though the sky was pitch black with the gathering storm clouds light shone upon the Hunting Legion blinding it to the attack that was about to come. Yet no attack would break Trogdor’s defensive spell. The beast had made a contract with the Hunting Legion and therefore they belonged to him. It was unacceptable for some other dragon to destroy the Ashbringer’s flock. That such a monster would claim supremacy of the skies over Trogdor was laughable. It was time for Fol-lu to see past the golden chivalry that drove the rescue of the Sparrow. Angels fall, so do dragons, and there is only one true sun in the sky.Fires erupted throughout the camp as the pentagram-like glyph lifted from the ground and rose into the air to meet the oncoming meteor. Skin blistering heat emanated from the spell upon the bandits below. Their hair would burn and skin melt leaving only the strongest alive. Red and gold light shimmered together above the flames of the camp making it a picture of hell. Abruptly the golden light disappeared leaving only fire below. A golden beacon shone in the sky as silence blanketed the land. The darkness above intensified as the meteor broke through the clouds, making the light from the Hunting Legion burn all the brighter. Judgement had come too late for the damned. Gods and wardens had no place in hell where demons ruled. The meteor would not hit the ground yet. Rather it collided with the pentagram and was teleported away in a flash of red and gold light. Fol-lu would not be allowed to flee from the scene of his own destruction. He had stayed for the fight and was now in it. Right in front of the feathered beast, the pentagram reappeared and a flaming meteor burst forth retaining its previous speed. Yet this wasn’t the real attack, it was only the beginning; a prelude to a response that would show the true meaning of anger. Down below the camp burned like an afterimage of the spell.", "1517482808000": "The golden dragon was too haughty for its own good. Altruism led it to believe that the red beast cared for the bandits. Trogdor only cared that he would be slighted. Pride blinded Fol-lu, making him think that he alone owned the skies. When Fol-lu turned back to the camp which burned in the vague shape of the previous pentagram, Trogdor attacked from above. The beast had used the meteor to distract and mask his movement. Fol-lu had been quick to turn and disregard his own attack making Trogdors maneuver all the more effective. Wings reaching backward, claws, jaws, and talons outstretched, Trogdor silently swooped upon the golden dragon, aiming to sink his claws into wings, back, and neck.“Kepesk troth ve. Yth nishka ocuir svaust kulti nomenoi svanti.” As the dragons neared collision Trogdor began to cast a spell in draconic.", "1517565998000": "The skywarden spent too much time looking down. Trogdor dived out of the pentagram and slammed into Fol-lu. The ruthless beast sank its teeth into the golden dragon, pushing him towards the ground. It would be a long fall.Below the land explodes. The space rock sinks deep into the earth. Shockwaves cascade outwards, crushing bandits, trees, and hills. A dust wave follows coating the land in an unbreathable miasma. Two dragons and one angel fall into the haze in a bloody battle. Trogdor cast his spell. A pressure barrier burst forth around the trio keeping the dust and debris away. As they fell the red dragon beat his wings to maintain the height advantage. With his left claw Trogdor sought to grasp and disable Fol-lu’s wing. He sunk his other claws into Fol’s back, side, or chest, if the feathered dragon had ever decided to look up instead of down. The deadly jaws went for the golden neck. Fol-lu had not reacted to Trogdor’s attack and would be cast down.", "1517603259000": "They plummeted like a falling star. Golden light flared but no further attacks had come from the accosted Skywarden. Trogdor locked his jaws around the neck of Fol-lu and sought to crush the life out of the majestic creature. It would be a terrible loss to the Overworld for Fol-lu, the Skywarden to die, but the dragon had entered the dangerous part of the Open Lands, and had tarried too long in the face of danger.Trogdor maintained the hold on the neck while he shook his head back and forth to increase the damage. His claws sought to further immobilize Fol-lu by securing a hold on his limbs. The red beast knew that a spell was coming. He would be vulnerable to such an attack now, but Fol-lu might not live to see the hit land. Or maybe the golden dragon would try to run, now that it had been underhandedly dealt with. Trogdor began to visualize a certain glyph in his mind that would help him deal with either an attack or attempt at retreat.", "1517607035000": "Trogdor roared in frustration as his prey dissipated into water. As the ground came at him the red dragon projected the teleportation glyph he had visualized onto the ground and dove into it, disappearing from the destroyed lands. The dragon would not forget being slighted so. The Hunting Legion was the only group that Trogdor had allied himself with. Trogdor would scry the location of the dragon that had destroyed this camp and get his revenge.", "1452196496000": "A small cave on the Desert Crag leads to a large cavern.  Here Trogdor has made his lair.  Gold, fine jewels, and enchanted items may be found here. Enter at your own peril.", "1452674079000": "A cloud of bats began to shriek as the dragon entered the cave for the first time.  They fell from their perches and took flight in a cacophonous tumult.  \"Qe ifpesp.\"  The dragons voice had a hypnotic whine to it.  With those word the bats returned to where they had been hanging and awaited the twilight hours.Trogdor chose the far corner of his cave and began to regurgitate his treasures. Gingerly he put down the enchanted mannequin.  He did not know what it did, but that hardly mattered.  Hanging the coat on the mannequin was difficult to say the least.  These items he had found at St. James Boutique in Isra.Next, Trogdor carefully propped the skrying glass against the wall of the cave.  The crystal mirror now only displayed his reflection.  This had been found at Red's Relics.The dragon towards the center of the cave. He opened his mouth and a molten stream of gold, silver, and bronze came pouring out. The metals swirled together as they cooled, creating a solid mound of metal. A good pillow for now, but some day Trogdor intended on filling the whole cave with valuables. The dragon began to cough, a frightening sound that made the bats chatter uneasily, as he hocked up a chain that held an enchantment of strength.  That it had not melted in the dragons stomach was a testament to the power of the enchantment.  These rare metals had once been a carriage owned by Giplor.  Trogdor took the chain and set it at the foot of the mannequin.   He was about to go to sleep he could still feel an unknown magic within himself.  After a fit of coughing, gagging, and perhaps a hurl Trogdor spat out four magical items he had consumed completely on accident: a 78 card tarot deck, a stone ring, a book titled The Way of the Seven Paths,  and a wooden staff.  The staff seemed to be some sort of communication device and the book was obviously a spell tomb.  The ring was harder to identify...a conduit between the book and ring perhaps?The tarot deck was familiar.  Trogdor's mind wandered back to that day in Ozmodias. The final words of the priests fortune reading stuck in his head. \"Death and you may follow the same path.\"  Trogdor liked that.  He chose to not to think about the rest of the foretelling.  Instead he stretched out upon the floor and went to sleep thinking of the ocean breeze and of the siren he had met. ", "1459642087000": "Sweet dream fade to reality. The dragon had slept a long and selfish sleep. Little did the beast know that the Phoenix State had faded into oblivion. The empire had grown too big and spread too thin. Climate control had proved ineffectual in sustaining a whole civilization. If Trogdor had only stood by Zaltos as a pillar of power things might have changed. Zaltos had called to Trogdor to wage war but the dragon had ignored his masters call for help.Trogdor awoke knowing little of what had happened during his slumber. He arched his back and gave his tail a swing before turning to the scrying mirror he had looted from Medan. \"Evnek Zaltos ekess ve.\" His hot breath fogged the mirror as the reflection changed into a swirling of mist. However, the mist did not resolve. Strange.  Trogdor would dwell on that later.  He extended his mind in search of the raven he had posted at the entrance.  It was still there. Time for some reconnaissance.", "1459758998000": "It did not take Trogdor long to learn that much had changed. \"Fueryon di wer thrae, bleviki, vur rekisixi di wer bekilk. Confn ekess ve.\" His breath floated out the cave. This was going to be a lengthy process.", "1459991506000": "Not big enough...Trogdor's hoard was not big enough.  As he passed back and forth in his too spacious cave the dragon began to grow angry.  It was during this small tantrum that the smoky scrying mirror finally resolved into mass of flames.  The energy emanating from the mirror was unmistakably that of Zaltos.  \"The Phoenix rises again.\" Trogdor could feel a well up of that golden mana within himself.  It was time for rider and dragon to be reunited. "}